samples/easysoa-samples-smarttravel/trip/src/test/resources/galaxyDemoTestRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<process xmlns="http://scenario1.j1.galaxy.inria.fr/">
			<arg0>ART</arg0>
			<arg1>I would like a bier !</arg1>
			<arg2>0.5</arg2>
		</process>
	</soap:Body>
</soap:Envelope>